import React from 'react'

function Header() {
    return (
        <div className="p-[2em]">
            <div className={"flex justify-between items-center"}>
                <div>
                    <img src="src/assets/logo.svg" alt=""/>
                </div>
                <div className={"flex justify-between items-center gap-[1rem]"}>
                    <div className={"text-[#3F3E3EE8] font-normal text-[0.8rem] hover:cursor-pointer hover:font-medium "}>
                        همکاری با ما
                    </div>
                    <div className={"text-[#3F3E3EE8] font-normal text-[0.8rem] hover:cursor-pointer hover:font-medium"}>
                        سوالات متداول
                    </div>
                    <div className={"text-[#3F3E3EE8] font-normal text-[0.8rem] hover:cursor-pointer hover:font-medium"}>
                        درباره ما
                    </div>
                    <button className="rounded-lg border-2 border-[#9B83A4] p-[0.4em] bg-transparent hover:bg-[#9B83A4] hover:text-white group transition-colors duration-300 ease-in-out">
                        <div>
                            <div className="flex items-center gap-1">
                                <svg
                                    width="19"
                                    height="16"
                                    viewBox="0 0 24 22"
                                    fill="currentColor"
                                    xmlns="http://www.w3.org/2000/svg"
                                    className="text-black group-hover:text-white transition-colors duration-300 ease-in-out"
                                >
                                    <path d="M18.9004 15.6175C17.5099 13.4305 15.3672 11.8624 12.8665 11.119C14.1035 10.4491 15.0645 9.42828 15.602 8.21338C16.1395 6.99848 16.2238 5.65664 15.842 4.39393C15.4601 3.13122 14.6332 2.01745 13.4883 1.22367C12.3433 0.429898 10.9436 0 9.50407 0C8.06456 0 6.66484 0.429898 5.51988 1.22367C4.37492 2.01745 3.54802 3.13122 3.16616 4.39393C2.78431 5.65664 2.86862 6.99848 3.40614 8.21338C3.94366 9.42828 4.90467 10.4491 6.14159 11.119C3.64096 11.8615 1.49822 13.4297 0.107764 15.6175C0.0567734 15.6931 0.0229518 15.7773 0.00829451 15.865C-0.00636273 15.9528 -0.00155869 16.0423 0.0224232 16.1283C0.046405 16.2143 0.089079 16.2951 0.147927 16.3658C0.206775 16.4366 0.280605 16.4959 0.365062 16.5403C0.449518 16.5847 0.54289 16.6132 0.639668 16.6242C0.736446 16.6352 0.83467 16.6285 0.928545 16.6044C1.02242 16.5804 1.11004 16.5394 1.18625 16.4841C1.26245 16.4287 1.32569 16.36 1.37223 16.282C3.09227 13.5776 6.13246 11.9629 9.50407 11.9629C12.8757 11.9629 15.9159 13.5776 17.6359 16.282C17.6824 16.36 17.7457 16.4287 17.8219 16.4841C17.8981 16.5394 17.9857 16.5804 18.0796 16.6044C18.1735 16.6285 18.2717 16.6352 18.3685 16.6242C18.4652 16.6132 18.5586 16.5847 18.6431 16.5403C18.7275 16.4959 18.8014 16.4366 18.8602 16.3658C18.9191 16.2951 18.9617 16.2143 18.9857 16.1283C19.0097 16.0423 19.0145 15.9528 18.9998 15.865C18.9852 15.7773 18.9514 15.6931 18.9004 15.6175ZM4.39143 5.98257C4.39143 5.06262 4.69128 4.16333 5.25306 3.39842C5.81485 2.6335 6.61333 2.03733 7.54754 1.68528C8.48176 1.33323 9.50974 1.24112 10.5015 1.42059C11.4932 1.60006 12.4042 2.04306 13.1192 2.69357C13.8343 3.34407 14.3212 4.17286 14.5185 5.07513C14.7157 5.97741 14.6145 6.91264 14.2275 7.76256C13.8406 8.61248 13.1853 9.33893 12.3445 9.85002C11.5037 10.3611 10.5153 10.6339 9.50407 10.6339C8.14855 10.6326 6.84898 10.1421 5.89049 9.27011C4.93199 8.3981 4.39288 7.21578 4.39143 5.98257Z" />
                                </svg>
                                <div className="font-normal text-[0.8rem] transition-colors duration-300 ease-in-out">
                                    ورود | ثبت نام
                                </div>
                            </div>
                        </div>
                    </button>
                </div>
            </div>
            <div className={"w-full h-[1px] mt-1 bg-[#7474744F]"}></div>
        </div>
    )
}

export default Header
